[
  {
    "category": "주거",
    "onboardingQuestion": "주거 자립을 위해 현재 주택 상황, 공과금 관리 능력, 비상 시 이사 계획은 준비되어 있나요?",
    "questions": {
      "최소한 향후 6개월 동안 머물 수 있는 안전한 장소가 있습니까?": true,
      "외부 지원 없이 월세나 주거비를 지불할 수 있나요?": false,
      "지역 주택법에 따른 세입자로서의 귀하의 권리를 알고 계십니까?": false,
      "집 유지 관리 또는 수리(예: 배관, 가전제품 수리)를 독립적으로 처리할 수 있습니까?": false,
      "공과금(예: 전기, 가스, 수도)을 제때에 관리합니까?": true,
      "귀하 지역의 저렴한 주택 옵션을 조사해 보셨습니까?": false,
      "집안 청소 일정을 만들고 따르는 것이 편안합니까?": false,
      "당신은 당신의 동네에 있는 비상연락처나 절차에 대한 기본적인 지식을 가지고 있습니까?": false,
      "현재 거주하고 있는 주택을 이용할 수 없을 경우 이사 계획을 세웠습니까?": true,
      "룸메이트와 함께 생활하고 갈등을 처리하는 능력에 자신이 있습니까?": false
    }
  },
  {
    "category": "금융",
    "onboardingQuestion": "현재의 재정 상태와 관리가 잘 되어있으며 재정적 안정석을 위해 계획을 가지고 계신가요?",
    "questions": {
      "귀하의 수입과 지출을 지속적으로 추적하고 있습니까?": false,
      "최소 3개월의 비용을 감당할 수 있는 개인 저축 계좌가 있습니까?": true,
      "귀하가 가지고 있는 대출이나 부채의 이자율을 알고 계십니까?": false,
      "알림 없이 제때에 청구서를 지불합니까?": false,
      "지출 결정을 내릴 때 원하는 것과 필요한 것을 구별할 수 있습니까?": true,
      "단기 및 장기 재정 목표를 설정했습니까?": false,
      "일상생활비를 신용카드나 대출에 의존하지 않습니까?": false,
      "주식, 채권, 저축 플랜 등의 투자 옵션에 대해 잘 알고 계십니까?": false,
      "귀하가 이용할 수 있는 정부 또는 민간 재정 지원 프로그램을 조사해 보셨습니까?": true,
      "오류나 사기를 모니터링하기 위해 은행 명세서를 정기적으로 검토합니까?": false
    }
  },
  {
    "category": "취업",
    "onboardingQuestion": "현재 직장이 있으며 전문성 있는 능력 향상을 위한 준비를 하고 있나요?",
    "questions": {
      "현재 직업이 있거나 정기적인 수입원이 있습니까?": true,
      "원하는 업종이나 직업에 맞게 이력서와 자기 소개서를 작성하셨나요?": true,
      "취업 면접과 전문적인 의사소통이 편안합니까?": false,
      "귀하의 분야에서 관련성을 유지하기 위해 정기적으로 귀하의 기술을 업데이트합니까?": false,
      "해당 분야의 전문가와 연결할 수 있는 네트워킹 기회를 알고 계십니까?": false,
      "경력 성장이나 전문성 개발을 위한 계획이 있습니까?": true,
      "직원으로서 귀하의 법적 권리(예: 계약, 근무 시간)를 잘 알고 계십니까?": false,
      "진로 지도에 도움을 줄 수 있는 멘토나 지원 시스템을 찾을 수 있습니까?": false,
      "근로자 수요가 증가하는 산업을 조사해 보셨나요?": false,
      "귀하는 일과 삶의 균형을 효과적으로 관리할 자신이 있습니까?": false
    }
  },
  {
    "category": "교육",
    "onboardingQuestion": "학습과 전문성 개발을 위해 여러 경로로 알아보고 목표 달성을 위해 학습을 진행 중인가요?",
    "questions": {
      "귀하의 경력 목표에 필요한 교육이나 훈련을 이수하셨습니까?": true,
      "기술 구축을 위한 무료 또는 저렴한 온라인 리소스에 대해 잘 알고 계십니까?": true,
      "귀하의 분야와 관련된 새로운 것을 정기적으로 읽거나 배우는 습관이 있습니까?": false,
      "귀하의 지식이나 기술의 격차를 확인하고 이를 해결할 방법을 모색했습니까?": true,
      "추가 교육을 위한 장학금이나 재정 지원을 받는 방법을 알고 있습니까?": false,
      "온라인 학습이나 연구를 위해 기술을 사용하는 것이 편안합니까?": false,
      "교육을 강화하기 위해 워크숍, 세미나 또는 행사에 참석합니까?": false,
      "귀하의 경력에 도움이 될 수 있는 인증이나 추가 자격을 알고 있습니까?": false,
      "교육과 기타 책임의 균형을 맞추기 위해 시간을 효율적으로 관리할 수 있습니까?": false,
      "교육과 관련된 개인 개발 계획을 완료했습니까?": false
    }
  },
  {
    "category": "건강",
    "onboardingQuestion": "정기적으로 신체적, 정신적 관리에 힘쓰며 미래 건강 관리를 위한 계획이 세워져있나요?",
    "questions": {
      "귀하는 1년에 한 번 이상 정기 검진을 위해 의사를 방문하십니까?": true,
      "최신 예방접종을 맞으셨나요?": false,
      "건강 보험이나 의료비를 보장할 계획이 있습니까?": true,
      "필요한 경우 정신 건강 자원에 접근하는 방법을 알고 있습니까?": true,
      "과일, 채소, 단백질이 포함된 균형 잡힌 식단을 유지하고 있습니까?": false,
      "일주일에 2~3회 이상 운동을 하시나요?": false,
      "흡연, 과음, 마약 사용 등 해로운 습관을 피합니까?": false,
      "적어도 7~8시간의 수면을 지속적으로 취합니까?": false,
      "일반적인 부상에 대한 기본적인 응급처치 방법을 알고 계십니까?": false,
      "스트레스를 이완요법이나 취미로 적극적으로 관리하시나요?": false
    }
  }
]
